src/InformationRegisters/Обороты/Обороты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Обороты</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПрихода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаРасхода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДатаДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидОперацииДокумента</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>CatalogRef.КатегорииДоходов</types>
      <types>CatalogRef.КатегорииРасходов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ВидСчета/ВидСчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидСчета</name>
  <enumValues>
    <name>Кошелек</name>
  </enumValues>
  <enumValues>
    <name>БанковскаяКарта</name>
  </enumValues>
  <enumValues>
    <name>БанковскийСчет</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ВидОперацииДокумента/ВидОперацииДокумента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидОперацииДокумента</name>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Приход</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Доходы/Доходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доходы</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Доходы</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДоходов</name>
    <type>
      <types>CatalogRef.КатегорииДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/Documents/Расход/Расход.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Расход</name>
  <registerRecords>AccumulationRegister.Баланс</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюта</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияРасхода</name>
    <type>
      <types>CatalogRef.КатегорииРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/CommonModules/ОбщийМодульСервер/Module.bsl
Функция ПолучитьИмяЗвуковогоФайла(ИмяФайла)Экспорт
	
	ИмяВРФайла = ПолучитьИмяВременногоФайла("mp3");
	Файл = ПолучитьОбщийМакет(ИмяФайла);
	Файл.Записать(ИмяВРФайла);
	
	Возврат ИмяВРФайла;
	
КонецФункции

#Область Редактирование_формы 

Процедура ДобавитьДекорациюНаФорму(Форма, ИмяДекорации, ЗаголовокДекорации, ИмяРодитель, ИзменитьЦветШрифта = Ложь, ГоризонтальноеПоложениеЛево)Экспорт
	
	ДекорацияУжеСоздана = ПроверитьСуществованиеЭлементаФормы(Форма, ИмяДекорации);
	Если НЕ ДекорацияУжеСоздана Тогда
		мДекорация = Форма.Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), Форма.Элементы[ИмяРодитель]);
	Иначе
		Форма.Элементы.Удалить(Форма.Элементы[ИмяДекорации]);
		мДекорация = Форма.Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), Форма.Элементы[ИмяРодитель]);
	КонецЕсли;
	
	мДекорация.Вид 								= ВидДекорацииФормы.Надпись;
	мДекорация.Заголовок 						= ЗаголовокДекорации;
	мДекорация.ГоризонтальноеПоложениеВГруппе 	= ?(ГоризонтальноеПоложениеЛево, ГоризонтальноеПоложениеЭлемента.Лево, ГоризонтальноеПоложениеЭлемента.Право);
	мДекорация.РастягиватьПоГоризонтали 		= Истина;
	мДекорация.Гиперссылка 						= Истина;
	мДекорация.УстановитьДействие("Нажатие", "ОбработкаНавигационнойСсылки");
	
	Если СтрНайти(ИмяРодитель, "Расходы") ИЛИ СтрНайти(ИмяРодитель, "Доходы") Тогда 
		мДекорация.Подсказка = ИмяРодитель;
	ИначеЕсли Форма.Элементы[ИмяРодитель].Родитель.Имя = "ГруппаСчета" Тогда
		//мДекорация.Подсказка = "Команда" + СтрЗаменить(ИмяДекорации, "Декорация", "");
		мДекорация.Подсказка = "Команда" + ЗаголовокДекорации;
	КонецЕсли;
	
	Если ИзменитьЦветШрифта Тогда		
		ЦветТекста = Новый Цвет(0,0,255);
		мДекорация.ЦветТекста = ЦветТекста;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКартинкуСчетаДекорации(Форма, ИмяДекорации, ИмяРодитель, ВидСчета)Экспорт
	
	ДекорацияУжеСоздана = ПроверитьСуществованиеЭлементаФормы(Форма, ИмяДекорации);
	Если НЕ ДекорацияУжеСоздана Тогда
		мДекорация = Форма.Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), Форма.Элементы[ИмяРодитель]);
	Иначе
		Форма.Элементы.Удалить(Форма.Элементы[ИмяДекорации]);
		мДекорация = Форма.Элементы.Добавить(ИмяДекорации, Тип("ДекорацияФормы"), Форма.Элементы[ИмяРодитель]);
	КонецЕсли;
	
	мДекорация.Вид = ВидДекорацииФормы.Картинка;
	мДекорация.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Лево;
	Если ВидСчета = Перечисления.ВидСчета.Кошелек Тогда
		мДекорация.Картинка = БиблиотекаКартинок.ОбщаяКартинка_Кошелек;
	ИначеЕсли ВидСчета = Перечисления.ВидСчета.БанковскийСчет Тогда
		мДекорация.Картинка = БиблиотекаКартинок.ОбщаяКартинка_БанковскийСчет;
	ИначеЕсли ВидСчета = Перечисления.ВидСчета.БанковскаяКарта Тогда
		мДекорация.Картинка = БиблиотекаКартинок.ОбщаяКартинка_БанковскаяКарта;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьГруппуНаФорму(Форма, ИмяГруппы, ЗаголовокГруппы, ИмяРодитель = Неопределено)Экспорт
	
	ГруппаУжеСоздана = ПроверитьСуществованиеЭлементаФормы(Форма, ИмяГруппы);
	Если НЕ ГруппаУжеСоздана Тогда
		Попытка
			мГруппа = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Форма.Элементы[ИмяРодитель]);
		Исключение
		    Сообщить("Имя группы: " + ИмяГруппы + Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		//мГруппа = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Форма.Элементы[ИмяРодитель]);
	Иначе
		Форма.Элементы.Удалить(Форма.Элементы[ИмяГруппы]);
		мГруппа = Форма.Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Форма.Элементы[ИмяРодитель]);
	КонецЕсли;
	
	мГруппа.Вид 						= ВидГруппыФормы.ОбычнаяГруппа;
	мГруппа.ОтображатьЗаголовок 		= Ложь;
	мГруппа.РастягиватьПоГоризонтали 	= Истина;
	мГруппа.Заголовок 					= ЗаголовокГруппы;
	
	
КонецПроцедуры

Процедура ДобавитьРеквизитНаФорму(Форма, МассивРеквизитов, Родитель = Неопределено)Экспорт
	Для Каждого Реквизит Из МассивРеквизитов Цикл                   
		НовыйЭлемент = Форма.Элементы.Добавить(Реквизит, Тип("ПолеФормы"));
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = Реквизит;
		#Если МобильноеПриложениеСервер Тогда
		НовыйЭлемент.РедактированиеТекста = Ложь;    	
		#КонецЕсли
			
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьРеквизитТабличнойЧастиНаФорму(Форма, МассивРеквизитов, Родитель)Экспорт
	
	Для Каждого РекввитТаблицы Из МассивРеквизитов Цикл
		НовыйЭлемент  = Форма.Элементы.Добавить(РекввитТаблицы, Тип("ПолеФормы"), Форма.Элементы[Родитель]);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;      
		НовыйЭлемент.ПутьКДанным = "Объект." + Родитель + "." + РекввитТаблицы;
	КонецЦикла;
	
КонецПроцедуры

Функция ПроверитьСуществованиеЭлементаФормы(Форма, ИмяЭлемента)
	
	ЕстьРеквизит = Форма.Элементы.Найти(ИмяЭлемента);
	
	Возврат ЕстьРеквизит <> Неопределено;
	
КонецФункции

Процедура УстановитьДействиеРеквизитуНаФорме(Форма, ИмяРеквизита, ИмяДействия, ИмяПроцедурыДействия)Экспорт	
	Форма.Элементы.Найти(ИмяРеквизита).УстановитьДействие(ИмяДействия, ИмяПроцедурыДействия);
КонецПроцедуры

Процедура ДобавитьКомандуНаФорму(Форма, ИмяКоманды, ИмяКомандыНаФорме, ЗаголовокКоманды)Экспорт

	КомандаНаФорме = Форма.Элементы.Добавить(ИмяКомандыНаФорме, Тип("КнопкаФормы"));
	КомандаНаФорме.ИмяКоманды 						= ИмяКоманды;
	КомандаНаФорме.Заголовок 						= ЗаголовокКоманды;
	КомандаНаФорме.ГоризонтальноеПоложениеВГруппе 	= ГоризонтальноеПоложениеЭлемента.Центр;
	КомандаНаФорме.РастягиватьПоГоризонтали 		= Истина;
	КомандаНаФорме.Фигура 							= ФигураКнопки.Овал;
	КомандаНаФорме.ЦветФона 						= WebЦвета.Зеленый;
	КомандаНаФорме.ЦветТекста 						= WebЦвета.Белый;

КонецПроцедуры


#КонецОбласти

#Область Движения_по_регистрам

Процедура ВыполнитьДвиженияВФоне(МассивДанных)Экспорт
	ФоновыеЗадания.Выполнить("ОбщийМодульСервер.ЗаписатьДанные", МассивДанных, Новый УникальныйИдентификатор, "Запись данных в регистр");
КонецПроцедуры 

Процедура ЗаписатьДанные(ДатаДокумента, ВидОперации, Категория, Счет, Валюта, СуммаДокумента)Экспорт
	
	НачатьТранзакцию();
	
	Попытка	
		СоздатьДокументДвижения(ДатаДокумента, ВидОперации, Категория, Счет, Валюта, СуммаДокумента);
		ДобавитьДанныеВРСОбороты(ДатаДокумента, ВидОперации, Категория, Счет, Валюта, СуммаДокумента);
	Исключение
		ОтменитьТранзакцию();
	КонецПопытки;

	Если ТранзакцияАктивна() Тогда
	    ЗафиксироватьТранзакцию();	
	КонецЕсли;
				
КонецПроцедуры

Процедура ДобавитьДанныеВРСОбороты(ДатаДокумента, ВидОперации, Категория, Счет, Валюта, СуммаДокумента)

	Запись = РегистрыСведений.Обороты.СоздатьМенеджерЗаписи();
	Запись.Период 			= ТекущаяДата();
	Запись.ДатаДокумента 	= ДатаДокумента;
	Запись.ВидОперации 		= ВидОперации;
	Запись.Категория 		= Категория;
	Запись.Счет 			= Счет;
	Запись.Валюта 			= Валюта;
	
	Если ВидОперации = Перечисления.ВидОперацииДокумента.Приход Тогда
	    Запись.СуммаПрихода 	= СуммаДокумента;
		Запись.СуммаДокумента 	= СуммаДокумента;
	ИначеЕсли ВидОперации = Перечисления.ВидОперацииДокумента.Расход Тогда
	    Запись.СуммаРасхода 	= СуммаДокумента;
		Запись.СуммаДокумента 	= -СуммаДокумента;
	КонецЕсли;
	
	Запись.Записать();
	Сообщить("Запись успешно добавлена");

КонецПроцедуры // ()

Процедура СоздатьДокументДвижения(ДатаДокумента, ВидОперации, Категория, Счет, Валюта, СуммаДокумента)
	
	Если ВидОперации = Перечисления.ВидОперацииДокумента.Приход Тогда
	    ДокПриход = Документы.Доходы.СоздатьДокумент();
		ДокПриход.Дата 				= ДатаДокумента;
		ДокПриход.КатегорияДоходов 	= Категория;
		ДокПриход.Счет 				= Счет;
		ДокПриход.Валюта 			= Валюта;
		ДокПриход.Сумма 			= СуммаДокумента;
		ДокПриход.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли ВидОперации = Перечисления.ВидОперацииДокумента.Расход Тогда	
	    ДокРасход = Документы.Расход.СоздатьДокумент();
		ДокРасход.Дата 				= ДатаДокумента;
		ДокРасход.КатегорияРасхода 	= Категория;
		ДокРасход.Счет 				= Счет;
		ДокРасход.Валюта 			= Валюта;
		ДокРасход.Сумма 			= СуммаДокумента;
		ДокРасход.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
